Revit 2024 API
MEPNetworkSegmentData.Velocity Property
 The calculated velocity of this segment, in ft/s.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double Velocity { get; }
Visual Basic
Public ReadOnly Property Velocity As Double
	Get
Visual C++
public:
property double Velocity {
	double get ();
}
See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace